---
kind: method
id: M:Autodesk.Revit.DB.Structure.AnalyticalMember.CanSplit
source: html/adf06b4a-485e-9368-37ce-16c5785913c9.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalMember.CanSplit Method

Identifies whether a particular analytical member can be split at a point on it's defining curve (by Split(Double) ).

## Syntax (C#)
```csharp
public bool CanSplit()
```

## Returns
True if the analytical member can be split, otherwise false.